Masmiseim36/nxpSDK/boards/twrkv46f150m/demo_apps/mc_pmsm/pin_mux.h
/*
 * Copyright (c) 2016, Freescale Semiconductor, Inc.
 * Copyright 2016-2018 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/***********************************************************************************************************************
 * Definitions
 **********************************************************************************************************************/

/*! @brief Direction type  */
typedef enum _pin_mux_direction
{
    kPIN_MUX_DirectionInput = 0U,        /* Input direction */
    kPIN_MUX_DirectionOutput = 1U,       /* Output direction */
    kPIN_MUX_DirectionInputOrOutput = 2U /* Input or output direction */
} pin_mux_direction_t;

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*! @name PORTD0 (number 93), J500[A40]/J501[9]/GPIOD0/PWM_A0/LED0
  @{ */
#define PINTOOL_PWM_PWM_A0_PERIPHERAL PWMA                              /*!<@brief Device name: PWMA */
#define PINTOOL_PWM_PWM_A0_SIGNAL A                                     /*!<@brief PWMA signal: A */
#define PINTOOL_PWM_PWM_A0_PORT PORTD                                   /*!<@brief PORT device name: PORTD */
#define PINTOOL_PWM_PWM_A0_PIN 0U                                       /*!<@brief PORTD pin index: 0 */
#define PINTOOL_PWM_PWM_A0_CHANNEL 0                                    /*!<@brief PWMA A channel: 0 */
#define PINTOOL_PWM_PWM_A0_PIN_NAME FlexPWM_A0                          /*!<@brief Pin name */
#define PINTOOL_PWM_PWM_A0_LABEL "J500[A40]/J501[9]/GPIOD0/PWM_A0/LED0" /*!<@brief Label */
#define PINTOOL_PWM_PWM_A0_NAME "PWM_A0"                                /*!<@brief Identifier name */
                                                                        /* @} */

/*! @name PORTD2 (number 95), J500[A38]/J501[30]/GPIOD2/PWM_A1/LED2
  @{ */
#define PINTOOL_PWM_PWM_A1_PERIPHERAL PWMA                               /*!<@brief Device name: PWMA */
#define PINTOOL_PWM_PWM_A1_SIGNAL A                                      /*!<@brief PWMA signal: A */
#define PINTOOL_PWM_PWM_A1_PORT PORTD                                    /*!<@brief PORT device name: PORTD */
#define PINTOOL_PWM_PWM_A1_PIN 2U                                        /*!<@brief PORTD pin index: 2 */
#define PINTOOL_PWM_PWM_A1_CHANNEL 1                                     /*!<@brief PWMA A channel: 1 */
#define PINTOOL_PWM_PWM_A1_PIN_NAME FlexPWM_A1                           /*!<@brief Pin name */
#define PINTOOL_PWM_PWM_A1_LABEL "J500[A38]/J501[30]/GPIOD2/PWM_A1/LED2" /*!<@brief Label */
#define PINTOOL_PWM_PWM_A1_NAME "PWM_A1"                                 /*!<@brief Identifier name */
                                                                         /* @} */

/*! @name PORTD4 (number 97), J500[B40]/J501[34]/GPIOD4/PWM_A2/LED4
  @{ */
#define PINTOOL_PWM_PWM_A2_PERIPHERAL PWMA                               /*!<@brief Device name: PWMA */
#define PINTOOL_PWM_PWM_A2_SIGNAL A                                      /*!<@brief PWMA signal: A */
#define PINTOOL_PWM_PWM_A2_PORT PORTD                                    /*!<@brief PORT device name: PORTD */
#define PINTOOL_PWM_PWM_A2_PIN 4U                                        /*!<@brief PORTD pin index: 4 */
#define PINTOOL_PWM_PWM_A2_CHANNEL 2                                     /*!<@brief PWMA A channel: 2 */
#define PINTOOL_PWM_PWM_A2_PIN_NAME FlexPWM_A2                           /*!<@brief Pin name */
#define PINTOOL_PWM_PWM_A2_LABEL "J500[B40]/J501[34]/GPIOD4/PWM_A2/LED4" /*!<@brief Label */
#define PINTOOL_PWM_PWM_A2_NAME "PWM_A2"                                 /*!<@brief Identifier name */
                                                                         /* @} */

/*! @name PORTD1 (number 94), J500[A39]/J501[11]/GPIOD1/PWM_B0/LED1
  @{ */
#define PINTOOL_PWM_PWM_B0_PERIPHERAL PWMA                               /*!<@brief Device name: PWMA */
#define PINTOOL_PWM_PWM_B0_SIGNAL B                                      /*!<@brief PWMA signal: B */
#define PINTOOL_PWM_PWM_B0_PORT PORTD                                    /*!<@brief PORT device name: PORTD */
#define PINTOOL_PWM_PWM_B0_PIN 1U                                        /*!<@brief PORTD pin index: 1 */
#define PINTOOL_PWM_PWM_B0_CHANNEL 0                                     /*!<@brief PWMA B channel: 0 */
#define PINTOOL_PWM_PWM_B0_PIN_NAME FlexPWM_B0                           /*!<@brief Pin name */
#define PINTOOL_PWM_PWM_B0_LABEL "J500[A39]/J501[11]/GPIOD1/PWM_B0/LED1" /*!<@brief Label */
#define PINTOOL_PWM_PWM_B0_NAME "PWM_B0"                                 /*!<@brief Identifier name */
                                                                         /* @} */

/*! @name PORTD3 (number 96), J500[A37]/J501[32]/GPIOD3/PWM_B1/LED3
  @{ */
#define PINTOOL_PWM_PWM_B1_PERIPHERAL PWMA                               /*!<@brief Device name: PWMA */
#define PINTOOL_PWM_PWM_B1_SIGNAL B                                      /*!<@brief PWMA signal: B */
#define PINTOOL_PWM_PWM_B1_PORT PORTD                                    /*!<@brief PORT device name: PORTD */
#define PINTOOL_PWM_PWM_B1_PIN 3U                                        /*!<@brief PORTD pin index: 3 */
#define PINTOOL_PWM_PWM_B1_CHANNEL 1                                     /*!<@brief PWMA B channel: 1 */
#define PINTOOL_PWM_PWM_B1_PIN_NAME FlexPWM_B1                           /*!<@brief Pin name */
#define PINTOOL_PWM_PWM_B1_LABEL "J500[A37]/J501[32]/GPIOD3/PWM_B1/LED3" /*!<@brief Label */
#define PINTOOL_PWM_PWM_B1_NAME "PWM_B1"                                 /*!<@brief Identifier name */
                                                                         /* @} */

