Masmiseim36/nxpSDK/boards/twrkv46f150m/demo_apps/mc_pmsm/pin_mux.h
/*! @name PORTD5 (number 98), J500[B39]/J501[36]/GPIOD5/PWM_B2/LED5
  @{ */
#define PINTOOL_PWM_PWM_B2_PERIPHERAL PWMA                               /*!<@brief Device name: PWMA */
#define PINTOOL_PWM_PWM_B2_SIGNAL B                                      /*!<@brief PWMA signal: B */
#define PINTOOL_PWM_PWM_B2_PORT PORTD                                    /*!<@brief PORT device name: PORTD */
#define PINTOOL_PWM_PWM_B2_PIN 5U                                        /*!<@brief PORTD pin index: 5 */
#define PINTOOL_PWM_PWM_B2_CHANNEL 2                                     /*!<@brief PWMA B channel: 2 */
#define PINTOOL_PWM_PWM_B2_PIN_NAME FlexPWM_B2                           /*!<@brief Pin name */
#define PINTOOL_PWM_PWM_B2_LABEL "J500[B39]/J501[36]/GPIOD5/PWM_B2/LED5" /*!<@brief Label */
#define PINTOOL_PWM_PWM_B2_NAME "PWM_B2"                                 /*!<@brief Identifier name */
                                                                         /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void PinTool_PWM(void);

/*! @name ADCA_CH3 (number 19), J500[A30]/J501[6]
  @{ */
#define BOARD_ADCA_PHA_PERIPHERAL ADC            /*!<@brief Device name: ADC */
#define BOARD_ADCA_PHA_SIGNAL ADCA               /*!<@brief ADC signal: ADCA */
#define BOARD_ADCA_PHA_CHANNEL 3                 /*!<@brief ADC ADCA channel: 3 */
#define BOARD_ADCA_PHA_PIN_NAME ADCA_CH3         /*!<@brief Pin name */
#define BOARD_ADCA_PHA_LABEL "J500[A30]/J501[6]" /*!<@brief Label */
#define BOARD_ADCA_PHA_NAME "ADCA_PHA"           /*!<@brief Identifier name */
                                                 /* @} */

/*! @name PORTE17 (number 11), J500[A28]/J501[12]/GPIOE17/ADCA_CH1
  @{ */
#define BOARD_ADCA_PHC_PERIPHERAL ADC                              /*!<@brief Device name: ADC */
#define BOARD_ADCA_PHC_SIGNAL ADCA                                 /*!<@brief ADC signal: ADCA */
#define BOARD_ADCA_PHC_PORT PORTE                                  /*!<@brief PORT device name: PORTE */
#define BOARD_ADCA_PHC_PIN 17U                                     /*!<@brief PORTE pin index: 17 */
#define BOARD_ADCA_PHC_CHANNEL 1                                   /*!<@brief ADC ADCA channel: 1 */
#define BOARD_ADCA_PHC_PIN_NAME ADCA_CH1                           /*!<@brief Pin name */
#define BOARD_ADCA_PHC_LABEL "J500[A28]/J501[12]/GPIOE17/ADCA_CH1" /*!<@brief Label */
#define BOARD_ADCA_PHC_NAME "ADCA_PHC"                             /*!<@brief Identifier name */
                                                                   /* @} */

/*! @name PORTE18 (number 12), J500[B30]/J501[18]/ADCB_CH0
  @{ */
#define BOARD_ADCB_UDCB_PERIPHERAL ADC                      /*!<@brief Device name: ADC */
#define BOARD_ADCB_UDCB_SIGNAL ADCB                         /*!<@brief ADC signal: ADCB */
#define BOARD_ADCB_UDCB_PORT PORTE                          /*!<@brief PORT device name: PORTE */
#define BOARD_ADCB_UDCB_PIN 18U                             /*!<@brief PORTE pin index: 18 */
#define BOARD_ADCB_UDCB_CHANNEL 0                           /*!<@brief ADC ADCB channel: 0 */
#define BOARD_ADCB_UDCB_PIN_NAME ADCB_CH0                   /*!<@brief Pin name */
#define BOARD_ADCB_UDCB_LABEL "J500[B30]/J501[18]/ADCB_CH0" /*!<@brief Label */
#define BOARD_ADCB_UDCB_NAME "ADCB_UDCB"                    /*!<@brief Identifier name */
                                                            /* @} */

/*! @name PORTE19 (number 13), J500[B29]/J501[20]/ADCB_CH1
  @{ */
#define BOARD_ADCB_PHA_PERIPHERAL ADC                      /*!<@brief Device name: ADC */
#define BOARD_ADCB_PHA_SIGNAL ADCB                         /*!<@brief ADC signal: ADCB */
#define BOARD_ADCB_PHA_PORT PORTE                          /*!<@brief PORT device name: PORTE */
#define BOARD_ADCB_PHA_PIN 19U                             /*!<@brief PORTE pin index: 19 */
#define BOARD_ADCB_PHA_CHANNEL 1                           /*!<@brief ADC ADCB channel: 1 */
#define BOARD_ADCB_PHA_PIN_NAME ADCB_CH1                   /*!<@brief Pin name */
#define BOARD_ADCB_PHA_LABEL "J500[B29]/J501[20]/ADCB_CH1" /*!<@brief Label */
#define BOARD_ADCB_PHA_NAME "ADCB_PHA"                     /*!<@brief Identifier name */
                                                           /* @} */

/*! @name PORTB1 (number 54), J500[B27]/J501[33]/GPIOB1/ADCB_CH3
  @{ */
#define BOARD_ADCB_PHB_PERIPHERAL ADC                             /*!<@brief Device name: ADC */
#define BOARD_ADCB_PHB_SIGNAL ADCB                                /*!<@brief ADC signal: ADCB */
#define BOARD_ADCB_PHB_PORT PORTB                                 /*!<@brief PORT device name: PORTB */
#define BOARD_ADCB_PHB_PIN 1U                                     /*!<@brief PORTB pin index: 1 */
#define BOARD_ADCB_PHB_CHANNEL 3                                  /*!<@brief ADC ADCB channel: 3 */
#define BOARD_ADCB_PHB_PIN_NAME ADCB_CH3                          /*!<@brief Pin name */
#define BOARD_ADCB_PHB_LABEL "J500[B27]/J501[33]/GPIOB1/ADCB_CH3" /*!<@brief Label */
#define BOARD_ADCB_PHB_NAME "ADCB_PHB"                            /*!<@brief Identifier name */
                                                                  /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void PinTool_ADC(void);

#define SOPT5_UART1RXSRC_UART_RX 0x00u /*!<@brief UART 1 receive data source select: UART1_RX pin */
#define SOPT5_UART1TXSRC_UART_TX 0x00u /*!<@brief UART 1 transmit data source select: UART1_TX pin */

/*! @name PORTE0 (number 1), J500[A44]/J501[5]/J505[4]/GPIOE0/TXD1
  @{ */
#define BOARD_DEBUG_UART_TX_PERIPHERAL UART1                              /*!<@brief Device name: UART1 */
#define BOARD_DEBUG_UART_TX_SIGNAL TX                                     /*!<@brief UART1 signal: TX */
#define BOARD_DEBUG_UART_TX_PORT PORTE                                    /*!<@brief PORT device name: PORTE */
#define BOARD_DEBUG_UART_TX_PIN 0U                                        /*!<@brief PORTE pin index: 0 */
#define BOARD_DEBUG_UART_TX_PIN_NAME UART1_TX                             /*!<@brief Pin name */
#define BOARD_DEBUG_UART_TX_LABEL "J500[A44]/J501[5]/J505[4]/GPIOE0/TXD1" /*!<@brief Label */
#define BOARD_DEBUG_UART_TX_NAME "DEBUG_UART_TX"                          /*!<@brief Identifier name */
                                                                          /* @} */

/*! @name PORTE1 (number 2), J500[A43]/J501[7]/J506[4]/GPIOE1/RXD1
  @{ */
#define BOARD_DEBUG_UART_RX_PERIPHERAL UART1                              /*!<@brief Device name: UART1 */
#define BOARD_DEBUG_UART_RX_SIGNAL RX                                     /*!<@brief UART1 signal: RX */
#define BOARD_DEBUG_UART_RX_PORT PORTE                                    /*!<@brief PORT device name: PORTE */
#define BOARD_DEBUG_UART_RX_PIN 1U                                        /*!<@brief PORTE pin index: 1 */
#define BOARD_DEBUG_UART_RX_PIN_NAME UART1_RX                             /*!<@brief Pin name */
#define BOARD_DEBUG_UART_RX_LABEL "J500[A43]/J501[7]/J506[4]/GPIOE1/RXD1" /*!<@brief Label */
#define BOARD_DEBUG_UART_RX_NAME "DEBUG_UART_RX"                          /*!<@brief Identifier name */
                                                                          /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void PinTool_UART(void);

/*! @name PORTA18 (number 50), Y1[1]/J500[B24]/J502[10]/GPIOA18/EXTAL_J
  @{ */
#define BOARD_EXTAL0_PERIPHERAL OSC                                   /*!<@brief Device name: OSC */
#define BOARD_EXTAL0_SIGNAL EXTAL0                                    /*!<@brief OSC signal: EXTAL0 */
#define BOARD_EXTAL0_PORT PORTA                                       /*!<@brief PORT device name: PORTA */
#define BOARD_EXTAL0_PIN 18U                                          /*!<@brief PORTA pin index: 18 */
#define BOARD_EXTAL0_PIN_NAME EXTAL0                                  /*!<@brief Pin name */
#define BOARD_EXTAL0_LABEL "Y1[1]/J500[B24]/J502[10]/GPIOA18/EXTAL_J" /*!<@brief Label */
#define BOARD_EXTAL0_NAME "EXTAL0"                                    /*!<@brief Identifier name */
                                                                      /* @} */

/*! @name PORTA19 (number 51), Y1[2]/J502[8]/GPIOA19/XTAL_J
  @{ */
#define BOARD_XTAL0_PERIPHERAL OSC                       /*!<@brief Device name: OSC */
#define BOARD_XTAL0_SIGNAL XTAL0                         /*!<@brief OSC signal: XTAL0 */
#define BOARD_XTAL0_PORT PORTA                           /*!<@brief PORT device name: PORTA */
#define BOARD_XTAL0_PIN 19U                              /*!<@brief PORTA pin index: 19 */
#define BOARD_XTAL0_PIN_NAME XTAL0                       /*!<@brief Pin name */
#define BOARD_XTAL0_LABEL "Y1[2]/J502[8]/GPIOA19/XTAL_J" /*!<@brief Label */
#define BOARD_XTAL0_NAME "XTAL0"                         /*!<@brief Identifier name */
                                                         /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void PinTool_OSC(void);

/*! @name PORTE6 (number 7), J5[1]/J502[11]/GPIOE6/FTM3_CH1/SW2
  @{ */
#define PINTOOL_MISC_SW2_PERIPHERAL GPIOE                           /*!<@brief Device name: GPIOE */
#define PINTOOL_MISC_SW2_SIGNAL GPIO                                /*!<@brief GPIOE signal: GPIO */
#define PINTOOL_MISC_SW2_GPIO GPIOE                                 /*!<@brief GPIO device name: GPIOE */
#define PINTOOL_MISC_SW2_GPIO_PIN 6U                                /*!<@brief PORTE pin index: 6 */
#define PINTOOL_MISC_SW2_PORT PORTE                                 /*!<@brief PORT device name: PORTE */
#define PINTOOL_MISC_SW2_PIN 6U                                     /*!<@brief PORTE pin index: 6 */
#define PINTOOL_MISC_SW2_CHANNEL 6                                  /*!<@brief GPIOE GPIO channel: 6 */
#define PINTOOL_MISC_SW2_PIN_NAME PTE6                              /*!<@brief Pin name */
#define PINTOOL_MISC_SW2_LABEL "J5[1]/J502[11]/GPIOE6/FTM3_CH1/SW2" /*!<@brief Label */
#define PINTOOL_MISC_SW2_NAME "SW2"                                 /*!<@brief Identifier name */
#define PINTOOL_MISC_SW2_DIRECTION kPIN_MUX_DirectionInput          /*!<@brief Direction */
                                                                    /* @} */

