Masmiseim36/nxpSDK/boards/twrkv46f150m/demo_apps/mc_pmsm/pin_mux.h
/*! @name PORTE24 (number 31), J1[2]/J500[B21]/J501[35]/GPIOE24/ADCB_CH4/THM2JP
  @{ */
/*!
 * @brief Device name: GPIOE */
#define PINTOOL_MISC_USER_LED_PERIPHERAL GPIOE
/*!
 * @brief GPIOE signal: GPIO */
#define PINTOOL_MISC_USER_LED_SIGNAL GPIO
/*!
 * @brief GPIO device name: GPIOE */
#define PINTOOL_MISC_USER_LED_GPIO GPIOE
/*!
 * @brief PORTE pin index: 24 */
#define PINTOOL_MISC_USER_LED_GPIO_PIN 24U
/*!
 * @brief PORT device name: PORTE */
#define PINTOOL_MISC_USER_LED_PORT PORTE
/*!
 * @brief PORTE pin index: 24 */
#define PINTOOL_MISC_USER_LED_PIN 24U
/*!
 * @brief GPIOE GPIO channel: 24 */
#define PINTOOL_MISC_USER_LED_CHANNEL 24
/*!
 * @brief Pin name */
#define PINTOOL_MISC_USER_LED_PIN_NAME PTE24
/*!
 * @brief Label */
#define PINTOOL_MISC_USER_LED_LABEL "J1[2]/J500[B21]/J501[35]/GPIOE24/ADCB_CH4/THM2JP"
/*!
 * @brief Identifier name */
#define PINTOOL_MISC_USER_LED_NAME "USER_LED"
/*!
 * @brief Direction */
#define PINTOOL_MISC_USER_LED_DIRECTION kPIN_MUX_DirectionOutput
/* @} */

/*! @name PORTB16 (number 62), J500[B52]/J502[1]/GPIOB16/XBARIN5
  @{ */
#define PINTOOL_MISC_DRV_EN_PERIPHERAL GPIOB                          /*!<@brief Device name: GPIOB */
#define PINTOOL_MISC_DRV_EN_SIGNAL GPIO                               /*!<@brief GPIOB signal: GPIO */
#define PINTOOL_MISC_DRV_EN_GPIO GPIOB                                /*!<@brief GPIO device name: GPIOB */
#define PINTOOL_MISC_DRV_EN_GPIO_PIN 16U                              /*!<@brief PORTB pin index: 16 */
#define PINTOOL_MISC_DRV_EN_PORT PORTB                                /*!<@brief PORT device name: PORTB */
#define PINTOOL_MISC_DRV_EN_PIN 16U                                   /*!<@brief PORTB pin index: 16 */
#define PINTOOL_MISC_DRV_EN_CHANNEL 16                                /*!<@brief GPIOB GPIO channel: 16 */
#define PINTOOL_MISC_DRV_EN_PIN_NAME PTB16                            /*!<@brief Pin name */
#define PINTOOL_MISC_DRV_EN_LABEL "J500[B52]/J502[1]/GPIOB16/XBARIN5" /*!<@brief Label */
#define PINTOOL_MISC_DRV_EN_NAME "DRV_EN"                             /*!<@brief Identifier name */
#define PINTOOL_MISC_DRV_EN_DIRECTION kPIN_MUX_DirectionOutput        /*!<@brief Direction */
                                                                      /* @} */

/*! @name PORTC7 (number 79), J4[1]/J500[B62]/GC7/SW1
  @{ */
#define PINTOOL_MISC_DRV_OC_PERIPHERAL PWMA                 /*!<@brief Device name: PWMA */
#define PINTOOL_MISC_DRV_OC_SIGNAL FAULT                    /*!<@brief PWMA signal: FAULT */
#define PINTOOL_MISC_DRV_OC_PORT PORTC                      /*!<@brief PORT device name: PORTC */
#define PINTOOL_MISC_DRV_OC_PIN 7U                          /*!<@brief PORTC pin index: 7 */
#define PINTOOL_MISC_DRV_OC_CHANNEL 0                       /*!<@brief PWMA FAULT channel: 0 */
#define PINTOOL_MISC_DRV_OC_PIN_NAME XBARIN4                /*!<@brief Pin name */
#define PINTOOL_MISC_DRV_OC_LABEL "J4[1]/J500[B62]/GC7/SW1" /*!<@brief Label */
#define PINTOOL_MISC_DRV_OC_NAME "DRV_OC"                   /*!<@brief Identifier name */
                                                            /* @} */

/*! @name PORTC6 (number 78), J500[B61]/GC6
  @{ */
#define PINTOOL_MISC_TMR_2_PERIPHERAL GPIOC      /*!<@brief Device name: GPIOC */
#define PINTOOL_MISC_TMR_2_SIGNAL GPIO           /*!<@brief GPIOC signal: GPIO */
#define PINTOOL_MISC_TMR_2_GPIO GPIOC            /*!<@brief GPIO device name: GPIOC */
#define PINTOOL_MISC_TMR_2_GPIO_PIN 6U           /*!<@brief PORTC pin index: 6 */
#define PINTOOL_MISC_TMR_2_PORT PORTC            /*!<@brief PORT device name: PORTC */
#define PINTOOL_MISC_TMR_2_PIN 6U                /*!<@brief PORTC pin index: 6 */
#define PINTOOL_MISC_TMR_2_CHANNEL 6             /*!<@brief GPIOC GPIO channel: 6 */
#define PINTOOL_MISC_TMR_2_PIN_NAME PTC6         /*!<@brief Pin name */
#define PINTOOL_MISC_TMR_2_LABEL "J500[B61]/GC6" /*!<@brief Label */
#define PINTOOL_MISC_TMR_2_NAME "TMR_2"          /*!<@brief Identifier name */
                                                 /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void PinTool_Misc(void);

/*! @name PORTA14 (number 44), J500[B46]/J502[16]/GPIOA14/SPI_CS0
  @{ */
#define PINTOOL_SPI_SPI_CS_PERIPHERAL SPI0                            /*!<@brief Device name: SPI0 */
#define PINTOOL_SPI_SPI_CS_SIGNAL PCS0_SS                             /*!<@brief SPI0 signal: PCS0_SS */
#define PINTOOL_SPI_SPI_CS_PORT PORTA                                 /*!<@brief PORT device name: PORTA */
#define PINTOOL_SPI_SPI_CS_PIN 14U                                    /*!<@brief PORTA pin index: 14 */
#define PINTOOL_SPI_SPI_CS_PIN_NAME SPI0_PCS0                         /*!<@brief Pin name */
#define PINTOOL_SPI_SPI_CS_LABEL "J500[B46]/J502[16]/GPIOA14/SPI_CS0" /*!<@brief Label */
#define PINTOOL_SPI_SPI_CS_NAME "SPI_CS"                              /*!<@brief Identifier name */
#define PINTOOL_SPI_SPI_CS_DIRECTION kPIN_MUX_DirectionOutput         /*!<@brief Direction */
                                                                      /* @} */

/*! @name PORTA15 (number 45), J500[B48]/J502[20]/GPIOA15/SPI_SCK
  @{ */
#define PINTOOL_SPI_SPI_SCK_PERIPHERAL SPI0                            /*!<@brief Device name: SPI0 */
#define PINTOOL_SPI_SPI_SCK_SIGNAL SCK                                 /*!<@brief SPI0 signal: SCK */
#define PINTOOL_SPI_SPI_SCK_PORT PORTA                                 /*!<@brief PORT device name: PORTA */
#define PINTOOL_SPI_SPI_SCK_PIN 15U                                    /*!<@brief PORTA pin index: 15 */
#define PINTOOL_SPI_SPI_SCK_PIN_NAME SPI0_SCK                          /*!<@brief Pin name */
#define PINTOOL_SPI_SPI_SCK_LABEL "J500[B48]/J502[20]/GPIOA15/SPI_SCK" /*!<@brief Label */
#define PINTOOL_SPI_SPI_SCK_NAME "SPI_SCK"                             /*!<@brief Identifier name */
#define PINTOOL_SPI_SPI_SCK_DIRECTION kPIN_MUX_DirectionOutput         /*!<@brief Direction */
                                                                       /* @} */

