Masmiseim36/nxpSDK/boards/twrkv46f150m/demo_apps/mc_pmsm/pin_mux.h
/*! @name PORTA16 (number 46), J500[B45]/J502[22]/GPIOA16/SPI_SOUT
  @{ */
#define PINTOOL_SPI_SPI_SOUT_PERIPHERAL SPI0                             /*!<@brief Device name: SPI0 */
#define PINTOOL_SPI_SPI_SOUT_SIGNAL SOUT                                 /*!<@brief SPI0 signal: SOUT */
#define PINTOOL_SPI_SPI_SOUT_PORT PORTA                                  /*!<@brief PORT device name: PORTA */
#define PINTOOL_SPI_SPI_SOUT_PIN 16U                                     /*!<@brief PORTA pin index: 16 */
#define PINTOOL_SPI_SPI_SOUT_PIN_NAME SPI0_SOUT                          /*!<@brief Pin name */
#define PINTOOL_SPI_SPI_SOUT_LABEL "J500[B45]/J502[22]/GPIOA16/SPI_SOUT" /*!<@brief Label */
#define PINTOOL_SPI_SPI_SOUT_NAME "SPI_SOUT"                             /*!<@brief Identifier name */
                                                                         /* @} */

/*! @name PORTA17 (number 47), J500[B44]/J502[18]/GPIOA17/SPI_SIN
  @{ */
#define PINTOOL_SPI_SPI_SIN_PERIPHERAL SPI0                            /*!<@brief Device name: SPI0 */
#define PINTOOL_SPI_SPI_SIN_SIGNAL SIN                                 /*!<@brief SPI0 signal: SIN */
#define PINTOOL_SPI_SPI_SIN_PORT PORTA                                 /*!<@brief PORT device name: PORTA */
#define PINTOOL_SPI_SPI_SIN_PIN 17U                                    /*!<@brief PORTA pin index: 17 */
#define PINTOOL_SPI_SPI_SIN_PIN_NAME SPI0_SIN                          /*!<@brief Pin name */
#define PINTOOL_SPI_SPI_SIN_LABEL "J500[B44]/J502[18]/GPIOA17/SPI_SIN" /*!<@brief Label */
#define PINTOOL_SPI_SPI_SIN_NAME "SPI_SIN"                             /*!<@brief Identifier name */
                                                                       /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void PinTool_SPI(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
